yeti_cup_conf/InformationRegisters/Dostizheniya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Dostizheniya</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>championship_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>role</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РолиНаЧемпионате</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>result</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>profile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Profile</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>championate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Championahips</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

yeti_cup_conf/Catalogs/Сайты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Сайты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

yeti_cup_conf/Catalogs/Championahips.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Championahips</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>descriptions</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>begin_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>end_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>location</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

yeti_cup_conf/CommonModules/РаботаСHttpСервисом/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////
// Получение страницы из справочника
///////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьСтраницу(Сайт, Страница) Экспорт
	
	Результат		= "";
	
	// получим "сайт"
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Сайты.Ссылка КАК Ссылка
	            	  |ПОМЕСТИТЬ Сайты
	            	  |ИЗ
	            	  |	Справочник.Сайты КАК Сайты
	            	  |ГДЕ
	            	  |	СОКРЛП(Сайты.Наименование) = &Сайт
	            	  |			И НЕ Сайты.ПометкаУдаления
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	Сайты.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	Справочник.Сайты КАК Сайты
	            	  |ГДЕ
	            	  |	Сайты.Ссылка В ИЕРАРХИИ
	            	  |			(ВЫБРАТЬ
	            	  |				Сайты.Ссылка КАК Ссылка
	            	  |			ИЗ
	            	  |				Сайты КАК Сайты)
	            	  |	И СОКРЛП(Сайты.Наименование) = &Страница
	            	  |			И НЕ Сайты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Сайт",		Сайт);
	Запрос.УстановитьПараметр("Страница",	Страница);
	
	Выборка			= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ВремФайл				= ПолучитьИмяВременногоФайла(Строка(Выборка.Ссылка.ТипЭлемента));
		Выборка.Ссылка.Данные.Получить().Записать(ВремФайл);
		
		ТекстовыйДокумент		= Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ВремФайл, КодировкаТекста.UTF8);
				
		Результат	= ТекстовыйДокумент.ПолучитьТекст();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////
// Получение списка чемпионатов за период
///////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьЧемпионатыЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Championahips.Наименование КАК Наименование,
	            	  |	Championahips.descriptions КАК Описание,
	            	  |	Championahips.location КАК МестоПроведения
	            	  |ИЗ
	            	  |	Справочник.Championahips КАК Championahips
	            	  |ГДЕ
	            	  |	Championahips.begin_date МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала",		ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	
	Данные			= Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Наименование",,"Наименование");
	Данные.Колонки.Добавить("Описание",,"Описание");
	Данные.Колонки.Добавить("МестоПроведения",,"Место проведения");
	
	Выборка			= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр		= Данные.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		
	КонецЦикла;
	
	Возврат ФормированиеHTML.СформироватьТаблицу("", Данные);
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////
// Получение достижений за период
///////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьДостиженияЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Dostizheniya.profile КАК profile,
	            	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Dostizheniya.championate) КАК championate,
	            	  |	СУММА(Dostizheniya.result) КАК result
	            	  |ПОМЕСТИТЬ Результаты
	            	  |ИЗ
	            	  |	РегистрСведений.Dostizheniya КАК Dostizheniya
	            	  |ГДЕ
	            	  |	Dostizheniya.championship_date МЕЖДУ &ДатаНачала И &ДатаОкончания
	            	  |
	            	  |СГРУППИРОВАТЬ ПО
	            	  |	Dostizheniya.profile
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	Результаты.profile КАК Участник,
	            	  |	Результаты.championate КАК Чемпионатов,
	            	  |	Результаты.result КАК ОбщийРезультат,
	            	  |	ВЫРАЗИТЬ(Результаты.result / Результаты.championate КАК ЧИСЛО(15, 2)) КАК СреднийРезультат
	            	  |ИЗ
	            	  |	Результаты КАК Результаты
	            	  |
	            	  |УПОРЯДОЧИТЬ ПО
	            	  |	СреднийРезультат УБЫВ";
	Запрос.УстановитьПараметр("ДатаНачала",		ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	
	Данные			= Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Участник",,"Участник");
	Данные.Колонки.Добавить("Чемпионатов",,"Кол-во чемпионатов");
	Данные.Колонки.Добавить("ОбщийРезультат",,"Общий результат");
	Данные.Колонки.Добавить("СреднийРезультат",,"Рейтинг");
	
	Выборка			= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр		= Данные.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка,,"Участник");
		
		НовСтр.Участник	= Выборка.Участник.last_name + " " + Выборка.Участник.fitst_name + " " + Выборка.Участник.second_name;
		
	КонецЦикла;
	
	Возврат ФормированиеHTML.СформироватьТаблицу("", Данные);
	
	
КонецФункции
